3. LidDrivenCavity/LidDrivenCavity-LiveStream/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;
vertices
(
    (0 0 0)
    (0.1000000014901161 0 0)
    (0.1000000014901161 0.1000000014901161 0)
    (0 0.1000000014901161 0)
    (0 0 0.0099999997764826)
    (0.1000000014901161 0 0.0099999997764826)
    (0.1000000014901161 0.1000000014901161 0.0099999997764826)
    (0 0.1000000014901161 0.0099999997764826)
);
blocks
(
    hex (0 1 2 3 4 5 6 7)  (20 20 1) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
    movingWall
   {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
   {
        type wall;
        faces
        (
            (0 1 5 4)
            (4 7 3 0)
            (1 2 6 5)
        );
    }
    frontAndBack
   {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
mergePatchPairs
(
);
