3. LidDrivenCavity/LidDrivenCavity-LiveStream/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p
    {
    	solver		PCG;
    	preconditioner	DIC;
    	tolerance	1e-06;
    	relTol		0.05;
    }
    pFinal
    {
    	$p;
    	relTol		0;
    }
    U
    {
    	solver		smoothSolver;
    	smoother	symGaussSeidel;
    	tolerance	1e-05;
    	relTol		0;
    }
}


PISO
{
	nCorrectors	2;
	nNonOrthogonalCorrectors 1;
	pRefCell	0;
	pRefValue	0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
